[
  "[Current Tournament] 2025_Africa_Cup_of_Nations Summary: The 2025 Africa Cup of Nations, known in short as the 2025 AFCON or CAN 2025 and for sponsorship purposes as the TotalEnergies 2025 Africa Cup of Nations, is the 35th edition of the biennial Africa Cup of Nations tournament organised by the Confederation of African Football (CAF). It is the second edition hosted by Morocco after 1988. Morocco was originally scheduled to host the 2015 edition, but withdrew due to fears stemming from the Western African Ebola virus epidemic.\nDue to FIFA expanding its Club World Cup competition to 32 teams and having it scheduled for June and July 2025, this edition of the tournament is played between 21 December 2025 and 18 January 2026. It is the first time that the tournament is played over the Christmas and New Year period. The situation has been further complicated by the addition of two extra match days scheduled for the last two weeks of January in the expanded 2025–26 UEFA Champions League season.\nThis edition of the tournament was scheduled to be",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Host selection: CAF stripped Cameroon from hosting the 2019 edition of the tournament on 30 November 2018 due to lack of speed of progress in preparations, but accepted former CAF president Ahmad Ahmad's request to stage the next edition in 2021. Consequently, the original hosts of 2021, Ivory Coast, became hosts of the 2023 edition with Guinea instead hosting the 2025 edition, which until then had no hosts. The CAF President confirmed the timetable shift after a meeting with Ivorian president Alassane Ouattara in Abidjan, Ivory Coast on 30 January 2019. On 30 September 2022, current CAF president Patrice Motsepe announced that Guinea had been stripped as host for the 2025 edition due to inadequacy and speed of progress in hosting preparations. Consequently, a new process was re-opened for a replacement host bidder. On 27 September 2023, the 2025 edition was awarded to Morocco and the 2027 edition to Kenya, Tanzania, and Uganda.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Mascot: The tournament mascot, named Assad (Arabic: أسد), was revealed on 8 December 2025. It is a Barbary lion, a reference to Morocco's national animal and nickname of the national team of Morocco.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Match ball: On 10 November 2025, CAF and Puma unveiled \"Itri\" (Standard Moroccan Amazigh: ⵉⵜⵔⵉ, lit. 'star') as the official tournament edition match ball. The ball, covered in Moroccan zellij art in red and green, is influenced by an ancient mosaic tradition known for its complex geometric decoration and reflects the shared spirit and enthusiasm of football across Africa. Produced by Puma using Orbital 6 technology, the design combines star-based forms, floral motifs and circular patterns, conveying joy and the coming together of the 24 nations taking part in the tournament.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Prize money: The winners will receive US$10 million, an increase from US$7 million for the 2023 event.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Qualification: The qualifiers were held between 20 March and 19 November 2024, starting with the preliminary round (20–26 March 2024) and then the group stage (2 September–19 November 2024). The preliminary round draw was held on 20 February 2024, 14:00 CAT (UTC+2) at the CAF headquarters in Cairo, Egypt. The eight involved national teams were seeded into two pots of four based on the FIFA World Rankings from 15 February 2024, Eritrea and Seychelles were excluded from the qualifiers. The eight teams were split into four ties which were played in home-and-away two-legged format. The four winners: Chad, Eswatini, Liberia, and South Sudan advanced to the group stage to join the 44 teams which entered directly. The group stage draw took place on 4 July 2024, 14:30 CAT (UTC+2) in Johannesburg, South Africa. The 48 national teams involved were divided into twelve groups of four each, which consisted of the 44 teams that entered directly, in addition to the four winners of the preliminary round, and were seeded into four pots of twelve each based on the June 2024 FIFA World Rankings.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Qualified teams: The following 24 teams qualified for this edition, all of them have previously participated in the tournament. Morocco, the host country, played in the qualifiers in Group B despite qualifying automatically. Ghana, four-time African champions, failed to qualify after finishing bottom of the Group F, missing out on the Africa Cup of Nations for the first time since 2004. Tunisia qualified for the 22nd time and extended their record for consecutive participations, reaching the tournament for the 17th time in a row, having not been absent since 1994. Comoros, Gabon, Sudan and Zimbabwe made their return to the continental tournament after missing out on 2023. Benin and Uganda made their return after an almost five-year absence from the event. Botswana qualified for the second time after their first participation in 2012. Cape Verde, Gambia, Guinea, Guinea-Bissau, Mauritania and Namibia also failed to qualify after appearing in 2023.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Venues: On 27 January 2025, The Confederation of African Football  (CAF) together with Royal Moroccan Football Federation and the Local Organizing Committee of the TotalEnergies CAF Africa Cup of Nations, Morocco 2025 announced the 9 venues in 6 cities that will host matches in the competition.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Referees: On 26 November 2025, CAF released the complete list of match officials appointed for the Africa Cup of Nations 2025. The list includes 73 officials in total: 28 referees, 31 assistant referees, and 14 VAR officials. All selected officials come exclusively from the African Confederation.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Draw: The draw took place on 27 January 2025 at the Mohammed V National Theatre in Rabat. The draw was conducted by Mustapha Hadji (Morocco), Serge Aurier (Ivory Coast), Aliou Cissé (Senegal) and Joseph Yobo (Nigeria).",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Group stage: The CAF announced the tournament schedule on 31 January 2025. \nThe top two teams of each group, along with the best four third-placed teams, will advance to the round of 16.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Tiebreakers: Teams will be ranked according to the three points for a win system (3 points for a win, 1 for a draw, 0 points for a loss), and if tied on points, the following tiebreaking criteria are applied, in the order given, to determine the rankings (Regulations Article 74):\n\nPoints in head-to-head matches among tied teams;\nGoal difference in head-to-head matches among tied teams;\nGoals scored in head-to-head matches among tied teams;\nIf more than two teams were tied, and after applying all head-to-head criteria above, if two teams are still tied, all head-to-head criteria above are applied exclusively to these two teams;\nGoal difference in all group matches;\nGoals scored in all group matches;\nDrawing of lots.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Knockout stage: The specific match-ups involving the third-placed teams depend on which four third-placed teams qualify for the round of 16:",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Goalscorers: There were 61 goals scored in 28 matches, for an average of 2.18 goals per match.\n3 goals\n\n2 goals\n\n1 goal\n\n1 own goal",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Discipline: A player was automatically suspended for the next match for the following offences:\n\nReceiving a red card (red card suspensions could be extended for serious offences)\nReceiving two yellow cards in two matches\nThe following suspensions occurred during the tournament:",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Man of the match: The Man of the Match award is presented after each game during the tournament. The award, presented by TotalEnergies, includes an official trophy handed to the player at the end of the match.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Broadcasting: Below is the list of the 2025 AFCON broadcasting rights holders:",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Gen Z protests: In late September 2025, a series of popular protests erupted in several cities in Morocco by young people calling themselves Gen Z 212. The protests were sparked by the deterioration of the country's health and education systems, widespread youth unemployment, and the government's excessive spending on sports infrastructure in preparation for hosting the 2025 Africa Cup of Nations and the 2030 FIFA World Cup, which Morocco is co-hosting with Spain and Portugal. On 6 October, during the CAF General Assembly meeting in Kinshasa, CAF President Patrice Motsepe confirmed that there was no intention of Morocco withdrawing from hosting the event and that the tournament would take place on schedule.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Host selection: CAF stripped Cameroon from hosting the 2019 edition of the tournament on 30 November 2018 due to lack of speed of progress in preparations, but accepted former CAF president Ahmad Ahmad's request to stage the next edition in 2021. Consequently, the original hosts of 2021, Ivory Coast, became hosts of the 2023 edition with Guinea instead hosting the 2025 edition, which until then had no hosts. The CAF President confirmed the timetable shift after a meeting with Ivorian president Alassane Ouattara in Abidjan, Ivory Coast on 30 January 2019. On 30 September 2022, current CAF president Patrice Motsepe announced that Guinea had been stripped as host for the 2025 edition due to inadequacy and speed of progress in hosting preparations. Consequently, a new process was re-opened for a replacement host bidder. On 27 September 2023, the 2025 edition was awarded to Morocco and the 2027 edition to Kenya, Tanzania, and Uganda.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Prize money: The winners will receive US$10 million, an increase from US$7 million for the 2023 event.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Qualification: The qualifiers were held between 20 March and 19 November 2024, starting with the preliminary round  and then the group stage . The preliminary round draw was held on 20 February 2024, 14:00 CAT  at the CAF headquarters in Cairo, Egypt. The eight involved national teams were seeded into two pots of four based on the FIFA World Rankings from 15 February 2024, Eritrea and Seychelles were excluded from the qualifiers. The eight teams were split into four ties which were played in home-and-away two-legged format. The four winners: Chad, Eswatini, Liberia, and South Sudan advanced to the group stage to join the 44 teams which entered directly. The group stage draw took place on 4 July 2024, 14:30 CAT  in Johannesburg, South Africa. The 48 national teams involved were divided into twelve groups of four each, which consisted of the 44 teams that entered directly, in addition to the four winners of the preliminary round, and were seeded into four pots of twelve each based on the June 2024 FIFA World Rankings.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Qualified teams: The following 24 teams qualified for this edition, all of them have previously participated in the tournament. Morocco, the host country, played in the qualifiers in Group B despite qualifying automatically. Ghana, four-time African champions, failed to qualify after finishing bottom of the Group F, missing out on the Africa Cup of Nations for the first time since 2004. Tunisia qualified for the 22nd time and extended their record for consecutive participations, reaching the tournament for the 17th time in a row, having not been absent since 1994. Comoros, Gabon, Sudan and Zimbabwe made their return to the continental tournament after missing out on 2023. Benin and Uganda made their return after an almost five-year absence from the event. Botswana qualified for the second time after their first participation in 2012. Cape Verde, Gambia, Guinea, Guinea-Bissau, Mauritania and Namibia also failed to qualify after appearing in 2023.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Venues: On 27 January 2025, The Confederation of African Football   together with Royal Moroccan Football Federation and the Local Organizing Committee of the TotalEnergies CAF Africa Cup of Nations, Morocco 2025 announced the 9 venues in 6 cities that will host matches in the competition.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Draw: The draw took place on 27 January 2025 at the Mohammed V National Theatre in Rabat. The draw was conducted by Mustapha Hadji , Serge Aurier , Aliou Cissé  and Joseph Yobo .",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Group stage: The CAF announced the tournament schedule on 31 January 2025. \nThe top two teams of each group, along with the best four third-placed teams, will advance to the round of 16.",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Knockout stage: The specific match-ups involving the third-placed teams depend on which four third-placed teams qualify for the round of 16:",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Goalscorers: There were 61 goals scored in 28 matches, for an average of 2.18 goals per match.\n3 goals\n\n2 goals\n\n1 goal\n\n1 own goal",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Discipline: A player was automatically suspended for the next match for the following offences:\n\nReceiving a red card \nReceiving two yellow cards in two matches\nThe following suspensions occurred during the tournament:",
  "[Current Tournament] 2025_Africa_Cup_of_Nations - Man of the match: The Man of the Match award is presented after each game during the tournament. The award, presented by TotalEnergies, includes an official trophy handed to the player at the end of the match.",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads Summary: The 2025 Africa Cup of Nations is an international football tournament being held in Morocco from 21 December 2025 to 18 January 2026. The 24 participating national teams were required to register a squad with a maximum 28 players.\nThe age listed for each player is on 21 December 2025, the first day of the tournament. The numbers of caps and goals listed for each player do not include any matches played after the start of the tournament. The club listed is the club for which the player last played a competitive match before the tournament. The nationality for each club reflects the national association (not the league) to which the club is affiliated. A flag is included for coaches who are of a different nationality than their own national team.",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Comoros: Comoros's 26 player squad was announced on 11 December.\nHead coach:  Stefano Cusin",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Mali: Mali announced their final squad of 28 players on 11 December.\nHead coach:  Tom Saintfiet",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Morocco: Morocco's final squad of 28 players was announced on 11 December.\nHead coach: Walid Regragui",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Zambia: Zambia's 28 player squad was announced on 10 December.\nHead coach: Moses Sichone",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Angola: Angola's squad of 28 players was announced on 3 December. Zini was ruled out of the tournament with an injury and replaced by Agostinho Calunga.\nHead coach:  Patrice Beaumelle",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Egypt: Egypt's squad of 28 players was announced on 2 December.\nHead coach: Hossam Hassan",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - South Africa: South Africa's squad of 25 players was announced on 1 December. Stand-by players Shabalala, Rayners and Moloisane were included in the official squad list, but did not travel with the team to Morocco.\nHead coach:  Hugo Broos",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Zimbabwe: Zimbabwe's 28 player squad was announced on 11 December.\nHead coach:  Mario Marinică",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Nigeria: Nigeria's 28 player squad was announced on 11 December.\nHead coach:  Éric Chelle",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Tanzania: Tanzania's 28 player squad was announced on 9 December.\nHead coach:  Miguel Gamondi",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Tunisia: Tunisia's 28 player squad was announced on 11 December.\nHead coach: Sami Trabelsi",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Uganda: Uganda announced a 30 player provisional squad on 7 December. Charles Lukwago and David Owori were left out of the final 28-man squad. \nHead coach:  Paul Put",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Benin: Benin announced a list of 30 player-provisional squad on 3 December.\nHead coach:  Gernot Rohr",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - DR Congo: DR Congo's 26 player squad was announced on 1 December. Mario Stroeykens was ruled out of the tournament with an injury and replaced by Gaël Kakuta.\nHead coach:  Sébastien Desabre",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Senegal: Senegal announced the final squad on 14 December. Later, both Ilay Camara and Assane Diao withdrew injured, replaced by Mamadou Camara and Ousseynou Niang.\nHead coach: Pape Thiaw",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Algeria: The 28-player squad of Algeria was announced on 13 December. On 19 December, Houssem Aouar withdrew from the tournament due to injury, and was replaced by Himad Abdelli.\nHead coach:  Vladimir Petković",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Burkina Faso: Burkina Faso's 25 player squad was announced on 8 December. Konaté, Tiendrébéogo and Yoda were included in the official squad list as reserve players.\nHead coach: Brama Traoré",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Gabon: Gabon's 28 player squad was announced on 10 December.\nHead coach: Thierry Mouyouma",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Ivory Coast: Ivory Coast's 26 player squad was announced on 9 December. Sébastien Haller was ruled out of the tournament with an injury and replaced by Evann Guessand.\nHead coach: Emerse Faé",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Mozambique: Mozambique's 25 player squad was announced on 8 December. Shaquille, Clesio and Cantolo were included in the squad list as reserve players and did not travel with the team.\nHead coach: Chiquinho Conde",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Statistics: Note: Only the final squad list of each national team is taken into consideration.",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Players by League Country: Nations in bold are represented at the tournament.",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Comoros: Comoros's 26 player squad was announced on 11 December.\nHead coach:  Stefano Cusin",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Mali: Mali announced their final squad of 28 players on 11 December.\nHead coach:  Tom Saintfiet",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Morocco: Morocco's final squad of 28 players was announced on 11 December.\nHead coach: Walid Regragui",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Zambia: Zambia's 28 player squad was announced on 10 December.\nHead coach: Moses Sichone",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Angola: Angola's squad of 28 players was announced on 3 December. Zini was ruled out of the tournament with an injury and replaced by Agostinho Calunga.\nHead coach:  Patrice Beaumelle",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Egypt: Egypt's squad of 28 players was announced on 2 December.\nHead coach: Hossam Hassan",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - South Africa: South Africa's squad of 25 players was announced on 1 December. Stand-by players Shabalala, Rayners and Moloisane were included in the official squad list, but did not travel with the team to Morocco.\nHead coach:  Hugo Broos",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Zimbabwe: Zimbabwe's 28 player squad was announced on 11 December.\nHead coach:  Mario Marinică",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Nigeria: Nigeria's 28 player squad was announced on 11 December.\nHead coach:  Éric Chelle",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Tanzania: Tanzania's 28 player squad was announced on 9 December.\nHead coach:  Miguel Gamondi",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Tunisia: Tunisia's 28 player squad was announced on 11 December.\nHead coach: Sami Trabelsi",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Uganda: Uganda announced a 30 player provisional squad on 7 December. Charles Lukwago and David Owori were left out of the final 28-man squad. \nHead coach:  Paul Put",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Benin: Benin announced a list of 30 player-provisional squad on 3 December.\nHead coach:  Gernot Rohr",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Botswana: Head coach:  Morena Ramoreboli",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - DR Congo: DR Congo's 26 player squad was announced on 1 December. Mario Stroeykens was ruled out of the tournament with an injury and replaced by Gaël Kakuta.\nHead coach:  Sébastien Desabre",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Senegal: Senegal announced the final squad on 14 December. Later, both Ilay Camara and Assane Diao withdrew injured, replaced by Mamadou Camara and Ousseynou Niang.\nHead coach: Pape Thiaw",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Algeria: The 28-player squad of Algeria was announced on 13 December. On 19 December, Houssem Aouar withdrew from the tournament due to injury, and was replaced by Himad Abdelli.\nHead coach:  Vladimir Petković",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Burkina Faso: Burkina Faso's 25 player squad was announced on 8 December. Konaté, Tiendrébéogo and Yoda were included in the official squad list as reserve players.\nHead coach: Brama Traoré",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Equatorial Guinea: Head coach: Juan Michá",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Sudan: Head coach:  James Kwesi Appiah",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Cameroon: Head coach: David Pagou",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Gabon: Gabon's 28 player squad was announced on 10 December.\nHead coach: Thierry Mouyouma",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Ivory Coast: Ivory Coast's 26 player squad was announced on 9 December. Sébastien Haller was ruled out of the tournament with an injury and replaced by Evann Guessand.\nHead coach: Emerse Faé",
  "[Full Squads and Players] 2025_Africa_Cup_of_Nations_squads - Mozambique: Mozambique's 25 player squad was announced on 8 December. Shaquille, Clesio and Cantolo were included in the squad list as reserve players and did not travel with the team.\nHead coach: Chiquinho Conde",
  "[Full Squads and Players] Comoros Manager: Stefano Cusin",
  "[Full Squads and Players] Comoros Player: Salim Ben Boina is a GK playing for Istres. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Ismaël Boura is a DF playing for Troyes. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Abdel-Hakim Abdallah is a DF playing for Guingamp. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Kenan Toibibou is a DF playing for Bravo. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Ahmed Soilihi is a DF playing for Toulon. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Iyad Mohamed is a MF playing for Casa Pia. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Faïz Selemani is a FW playing for Qatar SC. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Yannis Kari is a DF playing for Fréjus Saint-Raphaël. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Aboubacar Ali is a FW playing for Francs Borains. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Youssouf M'Changama is a MF playing for Al-Batin. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Rafiki Saïd is a FW playing for Standard Liège. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Kassim M'Dahoma is a DF playing for Aubagne. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Aymeric Ahmed is a FW playing for Strasbourg. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Rémy Vita is a MF playing for Tondela. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Benjaloud Youssouf is a MF playing for Sochaux. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Yannick Pandor is a GK playing for Francs Borains. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Myziane Maolida is a FW playing for Al-Kholood. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Yacine Bourhane is a MF playing for Aris Limassol. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Zaïd Amir is a FW playing for Istres. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: El Fardou Ben Nabouhane is a FW playing for Zemun. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Saïd Bakari is a DF playing for Sparta Rotterdam. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Adel Anzimati is a GK playing for Ararat Yerevan. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Idris Mohamed is a DF playing for Le Puy. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Raouf Mroivili is a MF playing for Villefranche. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Rayan Lutin is a MF playing for Amiens. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Comoros Player: Zaydou Youssouf is a MF playing for Al-Fateh. Head coach: Stefano Cusin.",
  "[Full Squads and Players] Mali Manager: Tom Saintfiet",
  "[Full Squads and Players] Mali Player: Ismael Diawara is a GK playing for Sirius. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Hamari Traoré is a DF playing for Paris FC. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Amadou Dante is a DF playing for Arouca. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Amadou Haidara is a MF playing for RB Leipzig. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Abdoulaye Diaby is a DF playing for Grasshopper. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Sikou Niakaté is a DF playing for Braga. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Dorgeles Nene is a FW playing for Fenerbahçe. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Mahamadou Doumbia is a MF playing for Al-Ittihad. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: El Bilal Touré is a FW playing for Beşiktaş. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Yves Bissouma is a MF playing for Tottenham Hotspur. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Lassana Coulibaly is a MF playing for Lecce. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Mohamed Camara is a MF playing for Al-Sadd. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Fodé Doucouré is a DF playing for Le Havre. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Mamadou Camara is a FW playing for Laval. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Mamadou Fofana is a DF playing for New England Revolution. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Djigui Diarra is a GK playing for Young Africans. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Lassine Sinayoko is a FW playing for Auxerre. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Mamadou Doumbia is a FW playing for Watford. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Kamory Doumbia is a MF playing for Brest. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Mamadou Sangaré is a MF playing for Lens. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Gaoussou Diarra is a FW playing for Feyenoord. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Mamadou Samassa is a GK playing for Laval. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Aliou Dieng is a MF playing for Al Ahly. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Ibrahima Sissoko is a MF playing for VfL Bochum. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Ousmane Camara is a DF playing for Angers. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Woyo Coulibaly is a DF playing for Sassuolo. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Gaoussou Diakité is a FW playing for Lausanne-Sport. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Mali Player: Nathan Gassama is a DF playing for Baltika Kaliningrad. Head coach: Tom Saintfiet.",
  "[Full Squads and Players] Morocco Manager: Walid Regragui",
  "[Full Squads and Players] Morocco Player: Yassine Bounou is a GK playing for Al-Hilal. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Achraf Hakimi is a DF playing for Paris Saint-Germain. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Noussair Mazraoui is a DF playing for Manchester United. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Sofyan Amrabat is a MF playing for Real Betis. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Nayef Aguerd is a DF playing for Marseille. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Romain Saïss is a DF playing for Al-Sadd. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Hamza Igamane is a FW playing for Lille. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Azzedine Ounahi is a MF playing for Girona. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Soufiane Rahimi is a FW playing for Al-Ain. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Brahim Díaz is a FW playing for Real Madrid. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Ismael Saibari is a MF playing for PSV Eindhoven. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Munir Mohamedi is a GK playing for RS Berkane. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Eliesse Ben Seghir is a MF playing for Bayer Leverkusen. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Oussama Targhalline is a MF playing for Feyenoord. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Mohamed Chibi is a DF playing for Pyramids. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Ilias Akhomach is a FW playing for Villarreal. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Abde Ezzalzouli is a FW playing for Real Betis. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Jawad El Yamiq is a DF playing for Al-Najma. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Youssef En-Nesyri is a FW playing for Fenerbahçe. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Ayoub El Kaabi is a FW playing for Olympiacos. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Chemsdine Talbi is a FW playing for Sunderland. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: El Mehdi Al Harrar is a GK playing for Raja CA. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Bilal El Khannouss is a MF playing for VfB Stuttgart. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Neil El Aynaoui is a MF playing for Roma. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Adam Masina is a DF playing for Torino. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Anass Salah-Eddine is a DF playing for PSV Eindhoven. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Abdelhamid Aït Boudlal is a DF playing for Rennes. Head coach: Walid Regragui.",
  "[Full Squads and Players] Morocco Player: Youssef Belammari is a DF playing for Raja CA. Head coach: Walid Regragui.",
  "[Full Squads and Players] Zambia Manager: Moses Sichone",
  "[Full Squads and Players] Zambia Player: Willard Mwanza is a GK playing for Power Dynamos. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Mathews Banda is a DF playing for Nkana. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Obino Chisala is a DF playing for Al-Merrikh. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Frankie Musonda is a DF playing for Bahrain SC. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Miguel Chaiwa is a MF playing for Hibernian. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Benson Sakala is a DF playing for Bohemians 1905. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Jack Lahne is a FW playing for Austria Lustenau. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Lubambo Musonda is a MF playing for Magdeburg. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Lameck Banda is a FW playing for Lecce. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Fashion Sakala is a FW playing for Al-Fayha. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Joseph Sabobo is a MF playing for Hapoel Be'er Sheva. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Wilson Chisala is a MF playing for Zanaco. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Stoppila Sunzu is a DF playing for Changchun Yatai. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Kabaso Chongo is a DF playing for ZESCO United. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Given Kalusa is a MF playing for MUZA. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Lawrence Mulenga is a GK playing for Power Dynamos. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Kings Kangwa is a MF playing for Hapoel Be'er Sheva. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Francis Mwansa is a GK playing for Zanaco. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Kennedy Musonda is a FW playing for Hapoel Ramat Gan. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Patson Daka is a FW playing for Leicester City. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Dominic Chanda is a DF playing for Power Dynamos. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: David Hamansenya is a DF playing for Leganés. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Pascal Phiri is a MF playing for ZESCO United. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Gift Mphande is a DF playing for ZESCO United. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Owen Tembo is a MF playing for Power Dynamos. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Joseph Liteta is a MF playing for Cagliari. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: Elia Mandanji is a FW playing for Zanaco. Head coach: Moses Sichone.",
  "[Full Squads and Players] Zambia Player: David Simukonda is a MF playing for ZESCO United. Head coach: Moses Sichone.",
  "[Full Squads and Players] Angola Manager: Patrice Beaumelle",
  "[Full Squads and Players] Angola Player: Hugo Marques is a GK playing for Petro de Luanda. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Núrio Fortuna is a DF playing for Volos. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Jonathan Buatu is a DF playing for Gil Vicente. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Clinton Mata is a DF playing for Lyon. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: David Carmo is a DF playing for Real Oviedo. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Kialonda Gaspar is a DF playing for Lecce. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Felício Milson is a FW playing for Red Star Belgrade. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Maestro is a MF playing for Alanyaspor. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: M'Bala Nzola is a FW playing for Pisa. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Gelson Dala is a FW playing for Al-Wakrah. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Ary Papel is a FW playing for Al-Akhdar. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Antonio Dominique is a GK playing for Étoile Carouge. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Tó Carneiro is a DF playing for AS FAR. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Manuel Benson is a FW playing for Swansea City. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Beni Mukendi is a MF playing for Vitória de Guimarães. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Fredy is a MF playing for Bodrum. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Randy Nteka is a MF playing for Rayo Vallecano. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Zito Luvumbo is a FW playing for Cagliari. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Mabululu is a FW playing for Al-Ahli Tripoli. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Manuel Keliano is a MF playing for Akhmat Grozny. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Eddie Afonso is a DF playing for Petro de Luanda. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Neblú is a GK playing for 1° de Agosto. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Show is a MF playing for Kocaelispor. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Mário Balbúrdia is a MF playing for Boluspor. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Rui Modesto is a DF playing for Udinese. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Agostinho Calunga is a GK playing for Wiliete. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Chico Banza is a FW playing for Zamalek. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Angola Player: Pedro Bondo is a DF playing for Famalicão. Head coach: Patrice Beaumelle.",
  "[Full Squads and Players] Egypt Manager: Hossam Hassan",
  "[Full Squads and Players] Egypt Player: Ahmed El Shenawy is a GK playing for Pyramids. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Khaled Sobhi is a DF playing for Al Masry. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Mohamed Hany is a DF playing for Al Ahly. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Hossam Abdelmaguid is a DF playing for Zamalek. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Ramy Rabia is a DF playing for Al-Ain. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Yasser Ibrahim is a DF playing for Al Ahly. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Trézéguet is a FW playing for Al Ahly. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Emam Ashour is a MF playing for Al Ahly. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Salah Mohsen is a FW playing for Al Masry. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Mohamed Salah is a FW playing for Liverpool. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Mostafa Mohamed is a FW playing for Nantes. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Mohamed Hamdy is a DF playing for Pyramids. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Ahmed Abou El Fotouh is a DF playing for Zamalek. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Hamdy Fathy is a MF playing for Al-Wakrah. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Mohamed Shehata is a MF playing for Zamalek. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Mohamed Sobhy is a GK playing for Zamalek. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Mohanad Lasheen is a MF playing for Pyramids. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Mostafa Fathi is a FW playing for Pyramids. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Marwan Attia is a MF playing for Al Ahly. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Ibrahim Adel is a FW playing for Al-Jazira. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Osama Faisal is a FW playing for National Bank of Egypt. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Omar Marmoush is a FW playing for Manchester City. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Mohamed El Shenawy is a GK playing for Al Ahly. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Ahmed Eid is a DF playing for Al Masry. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Zizo is a MF playing for Al Ahly. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Mostafa Shobeir is a GK playing for Al Ahly. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Mahmoud Saber is a MF playing for ZED. Head coach: Hossam Hassan.",
  "[Full Squads and Players] Egypt Player: Mohamed Ismail is a DF playing for Zamalek. Head coach: Hossam Hassan.",
  "[Full Squads and Players] South Africa Manager: Hugo Broos",
  "[Full Squads and Players] South Africa Player: Ronwen Williams is a GK playing for Mamelodi Sundowns. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Tylon Smith is a DF playing for Queens Park Rangers. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Khulumani Ndamane is a DF playing for TS Galaxy. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Teboho Mokoena is a MF playing for Mamelodi Sundowns. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Thalente Mbatha is a MF playing for Orlando Pirates. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Aubrey Modiba is a DF playing for Mamelodi Sundowns. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Oswin Appollis is a FW playing for Orlando Pirates. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Tshepang Moremi is a FW playing for Orlando Pirates. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Lyle Foster is a FW playing for Burnley. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Relebohile Mofokeng is a FW playing for Orlando Pirates. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Mohau Nkota is a FW playing for Al-Ettifaq. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Elias Mokwana is a FW playing for Al-Hazem. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Sphephelo Sithole is a MF playing for Tondela. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Mbekezeli Mbokazi is a DF playing for Orlando Pirates. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Bathusi Aubaas is a MF playing for Mamelodi Sundowns. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Sipho Chaine is a GK playing for Orlando Pirates. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Sipho Mbule is a MF playing for Orlando Pirates. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Samukele Kabini is a DF playing for Molde. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Nkosinathi Sibisi is a DF playing for Orlando Pirates. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Khuliso Mudau is a DF playing for Mamelodi Sundowns. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Siyabonga Ngezana is a DF playing for FCSB. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Ricardo Goss is a GK playing for Siwelele. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Evidence Makgopa is a FW playing for Orlando Pirates. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Shandre Campbell is a FW playing for Club Brugge. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Thabang Matuludi is a DF playing for Polokwane City. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Mduduzi Shabalala* is a MF playing for Kaizer Chiefs. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Iqraam Rayners* is a FW playing for Mamelodi Sundowns. Head coach: Hugo Broos.",
  "[Full Squads and Players] South Africa Player: Thabo Moloisane* is a DF playing for Stellenbosch. Head coach: Hugo Broos.",
  "[Full Squads and Players] Zimbabwe Manager: Mario Marinică",
  "[Full Squads and Players] Zimbabwe Player: Elvis Chipezeze is a GK playing for Magesi. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Gerald Takwara is a DF playing for Al-Ittihad Misurata. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Sean Fusire is a DF playing for Sheffield Wednesday. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Munashe Garananga is a DF playing for Copenhagen. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Divine Lunga is a DF playing for Mamelodi Sundowns. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Prosper Padera is a MF playing for SJK. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Prince Dube is a FW playing for Young Africans. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Jonah Fabisch is a MF playing for Erzgebirge Aue. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Macauley Bonne is a FW playing for Maldon & Tiptree. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Andy Rinomhota is a MF playing for Reading. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Washington Navaya is a FW playing for TelOne. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Bill Antonio is a FW playing for Mechelen. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Brendan Galloway is a DF playing for Plymouth Argyle. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Daniel Msendami is a FW playing for Marumo Gallants. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Teenage Hadebe is a DF playing for FC Cincinnati. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Martin Mapisa is a GK playing for MWOS. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Knowledge Musona is a MF playing for Scottland. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Marvelous Nakamba is a MF playing for Luton Town. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Tawanda Maswanhise is a FW playing for Motherwell. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Tawanda Chirewa is a MF playing for Wolverhampton Wanderers. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Godknows Murwira is a DF playing for Scottland. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Washington Arubi is a GK playing for Marumo Gallants. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Emmanuel Jalai is a DF playing for Dynamos. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Isheanesu Mauchi is a DF playing for Simba Bhora. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Alec Mudimu is a DF playing for Flint Town United. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Ishmael Wadi is a FW playing for CAPS United. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Junior Zindoga is a FW playing for TS Galaxy. Head coach: Mario Marinică.",
  "[Full Squads and Players] Zimbabwe Player: Tadiwa Chakuchichi is a MF playing for Scottland. Head coach: Mario Marinică.",
  "[Full Squads and Players] Nigeria Manager: Éric Chelle",
  "[Full Squads and Players] Nigeria Player: Francis Uzoho is a GK playing for Omonia. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Bright Osayi-Samuel is a DF playing for Birmingham City. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Zaidu Sanusi is a DF playing for Porto. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Wilfred Ndidi is a MF playing for Beşiktaş. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Igoh Ogbu is a DF playing for Slavia Prague. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Semi Ajayi is a DF playing for Hull City. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Ademola Lookman is a FW playing for Atalanta. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Frank Onyeka is a MF playing for Brentford. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Victor Osimhen is a FW playing for Galatasaray. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Fisayo Dele-Bashiru is a MF playing for Lazio. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Samuel Chukwueze is a FW playing for Fulham. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Cyriel Dessers is a FW playing for Panathinaikos. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Bruno Onyemaechi is a DF playing for Olympiacos. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Muhammed Usman Edu is a MF playing for Ironi Tiberias. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Moses Simon is a FW playing for Paris FC. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Amas Obasogie is a GK playing for Singida Black Stars. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Alex Iwobi is a MF playing for Fulham. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Raphael Onyedika is a MF playing for Club Brugge. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Paul Onuachu is a FW playing for Trabzonspor. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Chidozie Awaziem is a DF playing for Nantes. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Calvin Bassey is a DF playing for Fulham. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Akor Adams is a FW playing for Sevilla. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Stanley Nwabali is a GK playing for Chippa United. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Chidera Ejuke is a FW playing for Sevilla. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Salim Fago Lawal is a FW playing for Istra 1961. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Ebenezer Akinsanmiro is a MF playing for Pisa. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Ryan Alebiosu is a DF playing for Blackburn Rovers. Head coach: Éric Chelle.",
  "[Full Squads and Players] Nigeria Player: Tochukwu Nnadi is a MF playing for Zulte Waregem. Head coach: Éric Chelle.",
  "[Full Squads and Players] Tanzania Manager: Miguel Gamondi",
  "[Full Squads and Players] Tanzania Player: Hussein Masalanga is a GK playing for Singida Black Stars. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Pascal Msindo is a DF playing for Azam. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Nickson Kibabage is a DF playing for Simba. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Ibrahim Hamad is a DF playing for Young Africans. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Dickson Job is a DF playing for Young Africans. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Feisal Salum is a MF playing for Azam. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Iddy Nado is a FW playing for Azam. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Charles M'Mombwa is a MF playing for Floriana. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Selemani Mwalimu is a FW playing for Simba. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Mbwana Samatta is a FW playing for Le Havre. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Kibu Denis is a FW playing for Simba. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Simon Msuva is a FW playing for Al-Talaba. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Yakoub Suleiman Ali is a GK playing for Simba. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Bakari Mwamnyeto is a DF playing for Young Africans. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Mohamed Husseini is a DF playing for Young Africans. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Wilson Nangu is a DF playing for Simba. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Khalid Habibu Iddi is a MF playing for Singida Black Stars. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Morice Abraham is a MF playing for Simba. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Lusajo Mwaikenda is a DF playing for Azam. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Novatus Miroshi is a DF playing for Göztepe. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Kelvin John is a FW playing for AaB. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Shomari Kapombe is a DF playing for Simba. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Yusuph Kagoma is a MF playing for Simba. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Kelvin Nashon is a MF playing for Pamba. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Haji Mnoga is a MF playing for Salford City. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Tarryn Allarakhia is a MF playing for Rochdale. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Alphonce Msanga is a MF playing for Şamaxı. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tanzania Player: Zuberi Foba is a GK playing for Azam. Head coach: Miguel Gamondi.",
  "[Full Squads and Players] Tunisia Manager: Sami Trabelsi",
  "[Full Squads and Players] Tunisia Player: Noureddine Farhati is a GK playing for Stade Tunisien. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Ali Abdi is a DF playing for Nice. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Montassar Talbi is a DF playing for Lorient. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Yassine Meriah is a DF playing for Espérance de Tunis. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Mohamed Ali Ben Romdhane is a MF playing for Al Ahly. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Dylan Bronn is a DF playing for Servette. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Elias Achouri is a FW playing for Copenhagen. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Elias Saad is a FW playing for Augsburg. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Hazem Mastouri is a FW playing for Dynamo Makhachkala. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Hannibal Mejbri is a MF playing for Burnley. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Ismaël Gharbi is a MF playing for Augsburg. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Ali Maâloul is a DF playing for CS Sfaxien. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Ferjani Sassi is a MF playing for Al-Gharafa. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Mohamed Ben Ali is a DF playing for Espérance de Tunis. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Hadj Mahmoud is a MF playing for Lugano. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Aymen Dahmen is a GK playing for CS Sfaxien. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Ellyes Skhiri is a MF playing for Eintracht Frankfurt. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Nader Ghandri is a DF playing for Akhmat Grozny. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Firas Chaouat is a FW playing for Club Africain. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Yan Valery is a DF playing for Sheffield Wednesday. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Mortadha Ben Ouanes is a DF playing for Kasımpaşa. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Bechir Ben Saïd is a GK playing for Espérance de Tunis. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Naïm Sliti is a FW playing for Al-Shamal. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Adem Arous is a DF playing for Kasımpaşa. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Houssem Tka is a MF playing for Espérance de Tunis. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Sebastian Tounekti is a FW playing for Celtic. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Seifeddine Jaziri is a FW playing for Zamalek. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Tunisia Player: Sabri Ben Hessen is a GK playing for Étoile du Sahel. Head coach: Sami Trabelsi.",
  "[Full Squads and Players] Uganda Manager: Paul Put",
  "[Full Squads and Players] Uganda Player: Nafian Alionzi is a GK playing for Defence Force. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Rogers Torach is a DF playing for Vipers. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Timothy Awany is a DF playing for Ashdod. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Kenneth Semakula is a MF playing for Al-Adalah. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Toby Sibbick is a DF playing for Burton Albion. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Bobosi Byaruhanga is a MF playing for Oakland Roots. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Rogers Mato is a FW playing for Vardar. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Khalid Aucho is a MF playing for Singida Black Stars. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Uche Ikpeazu is a FW playing for St Johnstone. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Travis Mutyaba is a MF playing for CS Sfaxien. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Steven Mukwala is a FW playing for Simba. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Baba Alhassan is a MF playing for FCSB. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Elio Capradossi is a DF playing for Universitatea Cluj. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Denis Omedi is a FW playing for APR. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Jordan Obita is a DF playing for Hibernian. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Ronald Ssekiganda is a MF playing for APR. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Reagan Mpande is a FW playing for Villa. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Denis Onyango is a GK playing for Mamelodi Sundowns. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Jamal Salim is a GK playing for Richards Bay. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Isaac Muleme is a DF playing for Viktoria Žižkov. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Allan Okello is a MF playing for Vipers. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Jude Ssemugabi is a FW playing for Jamus. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Aziz Kayondo is a DF playing for Slovan Liberec. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: James Bogere is a FW playing for Masaka Sunshine. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Shafik Nana Kwikiriza is a FW playing for KCCA. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Hilary Mukundane is a DF playing for Vipers. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Melvyn Lorenzen is a FW playing for Muangthong United. Head coach: Paul Put.",
  "[Full Squads and Players] Uganda Player: Ivan Ahimbisibwe is a FW playing for KCCA. Head coach: Paul Put.",
  "[Full Squads and Players] Benin Manager: Gernot Rohr",
  "[Full Squads and Players] Benin Player: Marcel Dandjinou is a GK playing for Kruger United. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Rodrigue Fassinou is a MF playing for Coton. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Tamimou Ouorou is a DF playing for Sobemap. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Attidjikou Samadou is a MF playing for Smouha. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Yohan Roche is a DF playing for Petrolul Ploiești. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Olivier Verdon is a DF playing for Ludogorets Razgrad. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Mattéo Ahlinvi is a MF playing for Arsenal Tula. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Hassane Imourane is a MF playing for Grasshopper. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Steve Mounié is a FW playing for Alanyaspor. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Aiyegun Tosin is a FW playing for Lorient. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Rachid Moumini is a DF playing for Sumgayit. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: David Kiki is a DF playing for FCSB. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Mohamed Tijani is a DF playing for Yverdon-Sport. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Mariano Ahouangbo is a MF playing for Olimpija Ljubljana. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Sessi D'Almeida is a MF playing for Neftçi. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Saturnin Allagbé is a GK playing for Chauray. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Rodolfo Aloko is a MF playing for Kustošija. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Junior Olaitan is a MF playing for Göztepe. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Dodo Dokou is a MF playing for Leixões. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Jodel Dossou is a MF playing for Pays du Valois. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Rodrigue Kossi is a MF playing for Hassania Agadir. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Romaric Amoussou is a MF playing for ASEC Mimosas. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Serge Obassa is a GK playing for Remo Stars. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Razack Rachidou is a MF playing for Kustošija. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Olatoundji Tessilimi is a MF playing for SJK. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Charlemagne Azongnitode is a DF playing for Oulu. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Gislain Ahoudo is a MF playing for AS Gabès. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Benin Player: Adam Akimey is a FW playing for Helsingborg. Head coach: Gernot Rohr.",
  "[Full Squads and Players] Botswana Manager: Morena Ramoreboli",
  "[Full Squads and Players] Botswana Player: Kabelo Dambe is a GK playing for Township Rollers. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Thabo Leinanyane is a DF playing for Jwaneng Galaxy. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Thatayaone Ditlhokwe is a DF playing for Al-Ittihad Tripoli. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Mosha Gaolaolwe is a DF playing for Township Rollers. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Alford Velaphi is a DF playing for Gaborone United. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Gape Mohutsiwa is a MF playing for MC Oran. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Kabelo Seakanyeng is a FW playing for Maghreb Fez. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Olebogeng Ramotse is a MF playing for Jwaneng Galaxy. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Omaatla Kebatho is a FW playing for Jwaneng Galaxy. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Thabang Sesinyi is a FW playing for Jwaneng Galaxy. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Tumisang Orebonye is a FW playing for Wydad AC. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Mothusi Johnson is a DF playing for Gaborone United. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Segolame Boy is a MF playing for Sua Flamingoes. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Godiraone Modingwane is a MF playing for Botswana Defence Force. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Mothusi Cooper is a MF playing for Township Rollers. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Keagile Kgosipula is a GK playing for Mochudi Centre Chiefs. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Thatayaone Kgamanyane is a FW playing for Gaborone United. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Lebogang Ditsele is a MF playing for Gaborone United. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Chicco Molefe is a DF playing for Jwaneng Galaxy. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Tebogo Kopelang is a DF playing for Jwaneng Galaxy. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Thabo Maponda is a FW playing for Gaborone United. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Gilbert Baruti is a MF playing for Mochudi Centre Chiefs. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Goitseone Phoko is a GK playing for Jwaneng Galaxy. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Losika Ratshkudu is a FW playing for Ubuntu. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Monty Enosa is a MF playing for Mochudi Centre Chiefs. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] Botswana Player: Shanganani Ngada is a DF playing for Mochudi Centre Chiefs. Head coach: Morena Ramoreboli.",
  "[Full Squads and Players] DR Congo Manager: Sébastien Desabre",
  "[Full Squads and Players] DR Congo Player: Lionel Mpasi is a GK playing for Le Havre. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Aaron Wan-Bissaka is a DF playing for West Ham United. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Steve Kapuadi is a DF playing for Legia Warsaw. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Axel Tuanzebe is a DF playing for Burnley. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Dylan Batubinsika is a DF playing for Saint-Étienne. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Ngal'ayel Mukau is a MF playing for Lille. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Nathanaël Mbuku is a FW playing for Montpellier. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Samuel Moutoussamy is a MF playing for Atromitos. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Samuel Essende is a FW playing for Augsburg. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Théo Bongonda is a FW playing for Spartak Moscow. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Gaël Kakuta is a FW playing for Sakaryaspor. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Joris Kayembe is a DF playing for Genk. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Meschak Elia is a FW playing for Alanyaspor. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Noah Sadiki is a MF playing for Sunderland. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Rocky Bushiri is a DF playing for Hibernian. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Timothy Fayulu is a GK playing for Noah. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Cédric Bakambu is a FW playing for Real Betis. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Charles Pickel is a MF playing for Espanyol. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Fiston Mayele is a FW playing for Pyramids. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Brian Cipenga is a FW playing for Castellón. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Matthieu Epolo is a GK playing for Standard Liège. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Chancel Mbemba is a DF playing for Lille. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Simon Banza is a FW playing for Al-Jazira. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Gédéon Kalulu is a DF playing for Aris Limassol. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Edo Kayembe is a MF playing for Watford. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Arthur Masuaku is a DF playing for Sunderland. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Michel-Ange Balikwisha is a FW playing for Celtic. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] DR Congo Player: Dimitry Bertaud is a GK playing for Unattached. Head coach: Sébastien Desabre.",
  "[Full Squads and Players] Senegal Manager: Pape Thiaw",
  "[Full Squads and Players] Senegal Player: Yehvann Diouf is a GK playing for Nice. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Mamadou Sarr is a DF playing for Strasbourg. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Kalidou Koulibaly is a DF playing for Al-Hilal. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Abdoulaye Seck is a DF playing for Maccabi Haifa. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Idrissa Gueye is a MF playing for Everton. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Pathé Ciss is a MF playing for Rayo Vallecano. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Habib Diarra is a MF playing for Sunderland. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Lamine Camara is a MF playing for Monaco. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Boulaye Dia is a FW playing for Lazio. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Sadio Mané is a FW playing for Al-Nassr. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Nicolas Jackson is a FW playing for Bayern Munich. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Cherif Ndiaye is a FW playing for Samsunspor. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Iliman Ndiaye is a FW playing for Everton. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Ismail Jakobs is a DF playing for Galatasaray. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Krépin Diatta is a DF playing for Monaco. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Édouard Mendy is a GK playing for Al-Ahli. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Pape Matar Sarr is a MF playing for Tottenham Hotspur. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Ismaïla Sarr is a FW playing for Crystal Palace. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Moussa Niakhaté is a DF playing for Lyon. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Habib Diallo is a FW playing for Metz. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Cheikh Sabaly is a FW playing for Metz. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Ousseynou Niang is a MF playing for Union SG. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Mory Diaw is a GK playing for Le Havre. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Antoine Mendy is a DF playing for Nice. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: El Hadji Malick Diouf is a DF playing for West Ham United. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Pape Gueye is a MF playing for Villarreal. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Ibrahim Mbaye is a FW playing for Paris Saint-Germain. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Senegal Player: Mamadou Camara is a MF playing for RS Berkane. Head coach: Pape Thiaw.",
  "[Full Squads and Players] Algeria Manager: Vladimir Petković",
  "[Full Squads and Players] Algeria Player: Anthony Mandrea is a GK playing for Caen. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Aïssa Mandi is a DF playing for Lille. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Mehdi Dorval is a DF playing for Bari. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Mohamed Amine Tougai is a DF playing for Espérance de Tunis. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Zineddine Belaïd is a DF playing for JS Kabylie. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Ramiz Zerrouki is a MF playing for Twente. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Riyad Mahrez is a MF playing for Al-Ahli. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Himad Abdelli is a MF playing for Angers. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Baghdad Bounedjah is a FW playing for Al-Shamal. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Ismaël Bennacer is a MF playing for Dinamo Zagreb. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Anis Hadj Moussa is a FW playing for Feyenoord. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Monsef Bakrar is a FW playing for Dinamo Zagreb. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Jaouen Hadjam is a DF playing for Young Boys. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Hicham Boudaoui is a MF playing for Nice. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Rayan Aït-Nouri is a DF playing for Manchester City. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Oussama Benbot is a GK playing for USM Alger. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Farès Chaïbi is a MF playing for Eintracht Frankfurt. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Mohamed Amoura is a FW playing for VfL Wolfsburg. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Adem Zorgane is a MF playing for Union SG. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Youcef Atal is a DF playing for Al-Sadd. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Ramy Bensebaini is a DF playing for Borussia Dortmund. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Ibrahim Maza is a MF playing for Bayer Leverkusen. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Luca Zidane is a GK playing for Granada. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Ilan Kebbal is a MF playing for Paris FC. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Rafik Belghali is a DF playing for Hellas Verona. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Samir Chergui is a DF playing for Paris FC. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Adil Boulbina is a MF playing for Al-Duhail. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Algeria Player: Redouane Berkane is a FW playing for Al-Wakrah. Head coach: Vladimir Petković.",
  "[Full Squads and Players] Burkina Faso Manager: Brama Traoré",
  "[Full Squads and Players] Burkina Faso Player: Farid Ouédraogo is a GK playing for Al Hilal. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Lassina Traoré is a FW playing for Shakhtar Donetsk. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Abdoul Ayinde is a DF playing for Gent. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Adamo Nagalo is a DF playing for PSV Eindhoven. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Nasser Djiga is a DF playing for Rangers. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Mohamed Zougrana is a MF playing for MC Alger. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Dango Ouattara is a FW playing for Brentford. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Cedric Badolo is a MF playing for Spartak Trnava. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Issa Kaboré is a DF playing for Wrexham. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Bertrand Traoré is a FW playing for Sunderland. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Ousseni Bouda is a FW playing for San Jose Earthquakes. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Edmond Tapsoba is a DF playing for Bayer Leverkusen. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Mohamed Konaté* is a FW playing for Akhmat Grozny. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Issoufou Dayo is a DF playing for Umm Salal. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Abdoul Yoda* is a MF playing for Milsami Orhei. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Hervé Koffi is a GK playing for Angers. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Stephane Aziz Ki is a MF playing for Wydad AC. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Ismahila Ouédraogo is a MF playing for OB. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Georgi Minoungou is a FW playing for Seattle Sounders. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Gustavo Sangaré is a MF playing for Noah. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Cyriaque Irié is a FW playing for SC Freiburg. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Blati Touré is a MF playing for Pyramids. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Kilian Nikiema is a GK playing for ADO Den Haag. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Saïdou Simporé is a MF playing for National Bank of Egypt. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Steeve Yago is a DF playing for Aris Limassol. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Arsène Kouassi is a DF playing for Lorient. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Pierre Landry Kaboré is a FW playing for Heart of Midlothian. Head coach: Brama Traoré.",
  "[Full Squads and Players] Burkina Faso Player: Josué Tiendrébéogo* is a MF playing for Annecy. Head coach: Brama Traoré.",
  "[Full Squads and Players] Equatorial Guinea Manager: Juan Michá",
  "[Full Squads and Players] Equatorial Guinea Player: Jesús Owono is a GK playing for FC Andorra. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Néstor Senra is a DF playing for Recreativo. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Marvin Anieboh is a DF playing for SS Reyes. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Álex Balboa is a MF playing for Lugo. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Omar Mascarell is a MF playing for Mallorca. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Iban Salvador is a FW playing for Wisła Płock. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: José Machín is a MF playing for Vis Pesaro. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Jannick Buyla is a MF playing for Numancia. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Dorian Jr. is a FW playing for Viborg. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Emilio Nsue is a FW playing for Intercity. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Basilio Ndong is a DF playing for Tirana. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Charles Ondo is a DF playing for Portland Timbers. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Aitor Embela is a GK playing for Soneja. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Pedro Obiang is a MF playing for Monza. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Carlos Akapo is a DF playing for Amazonas. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Saúl Coco is a DF playing for Torino. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Josete Miranda is a FW playing for Kalamata. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Michael Ngaah is a DF playing for Ávila. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Luís Asué is a FW playing for Shanghai Shenhua. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Santiago Eneme is a MF playing for Sparta Prague. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Esteban Obiang is a DF playing for Argeș Pitești. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Pablo Ganet is a MF playing for Persita Tangerang. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Manuel Sapunga is a GK playing for Sekhukhune United. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Loren Zúñiga is a FW playing for Real Madrid. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Javier Mum is a DF playing for MUZA. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: José Nabil Ondo is a FW playing for Nantes. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Gael Joel Akogo is a MF playing for Granada. Head coach: Juan Michá.",
  "[Full Squads and Players] Equatorial Guinea Player: Álex Masogo is a MF playing for Beroe. Head coach: Juan Michá.",
  "[Full Squads and Players] Sudan Manager: James Kwesi Appiah",
  "[Full Squads and Players] Sudan Player: Ali Abu Eshrein is a GK playing for Al Hilal. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Abuaagla Abdalla is a MF playing for Al-Ahly Benghazi. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Mohamed Ering is a DF playing for Al Hilal. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Altayeb Abdelrazeg is a DF playing for Al Hilal. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Walieldin Khedr is a MF playing for Al Hilal. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Mustafa Karshoum is a DF playing for Al Hilal. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Yaser Awad is a DF playing for Al Hilal. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Abdel Raouf is a MF playing for Al Hilal. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Yaser Muzmel is a FW playing for Al Hilal. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Mohamed Abdelrahman is a FW playing for Al Hilal. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: John Mano is a FW playing for Al-Akhdar. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Bakhit Khamis is a DF playing for Al-Ahli Tripoli. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Ammar Taifour is a MF playing for CS Sfaxien. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Mohamed Eisa is a FW playing for Uthai Thani. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Salah Adel is a MF playing for Al Hilal. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Muhamed Alnour Abouja is a GK playing for Al-Merrikh. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Mazin Mohamedein is a DF playing for Al-Akhdar. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Awad Zayed is a DF playing for Al-Merrikh. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Ahmed Tabanja is a DF playing for Al-Merrikh. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Abo Eisa is a FW playing for Chonburi. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Munjed Alnil is a GK playing for Al Merreikh. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Al-Jezoli Nouh is a FW playing for Al-Ahli Tripoli. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Abdelsamad Manen is a MF playing for Al-Zamala SC. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Muhamed Kesra is a DF playing for Jamus. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Sheddy Barglan is a DF playing for Den Bosch. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Aamir Abdallah is a FW playing for Avondale. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Sudan Player: Muhamed Tia Asad is a FW playing for Al-Merrikh. Head coach: James Kwesi Appiah.",
  "[Full Squads and Players] Cameroon Manager: David Pagou",
  "[Full Squads and Players] Cameroon Player: Simon Omossola is a GK playing for Saint-Éloi Lupopo. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Junior Tchamadeu is a DF playing for Stoke City. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Che Malone is a DF playing for USM Alger. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Christopher Wooh is a DF playing for Spartak Moscow. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Nouhou Tolo is a DF playing for Seattle Sounders. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Gerzino Nyamsi is a DF playing for Lokomotiv Moscow. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Georges-Kévin Nkoudou is a FW playing for Diriyah. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Jean Onana is a MF playing for Genoa. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Frank Magri is a FW playing for Toulouse. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Bryan Mbeumo is a FW playing for Manchester United. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Christian Bassogog is a FW playing for Al-Okhdood. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Patrick Soko is a FW playing for Almería. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Darlin Yongwa is a DF playing for Lorient. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Danny Namaso is a FW playing for Auxerre. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Arthur Avom is a MF playing for Lorient. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Devis Epassy is a GK playing for Dinamo București. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Samuel Kotto is a DF playing for Gent. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Aboubakar Nagida is a DF playing for Rennes. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Martin Ndzie is a MF playing for Rapid Wien. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Olivier Kemen is a MF playing for İstanbul Başakşehir. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Karl Etta Eyong is a FW playing for Levante. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Flavien Enzo Boyomo is a DF playing for Osasuna. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Simon Ngapandouetnbu is a GK playing for Montpellier. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Carlos Baleba is a MF playing for Brighton & Hove Albion. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Éric Junior Dina Ebimbe is a MF playing for Brest. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Christian Kofane is a FW playing for Bayer Leverkusen. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Arnold Maël Kamdem is a MF playing for Sport Sinop. Head coach: David Pagou.",
  "[Full Squads and Players] Cameroon Player: Edouard Sombang is a GK playing for Colombe Sportive. Head coach: David Pagou.",
  "[Full Squads and Players] Gabon Manager: Thierry Mouyouma",
  "[Full Squads and Players] Gabon Player: Anse Ngoubi Demba is a GK playing for Mosta. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Aaron Appindangoyé is a DF playing for Sivasspor. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Anthony Oyono is a DF playing for Frosinone. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Alex Moucketou-Moussounda is a DF playing for Aris Limassol. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Bruno Ecuele Manga is a DF playing for Paris 13 Atletico. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Johann Obiang is a DF playing for Orléans. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Royce Openda is a FW playing for Bordeaux. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Clench Loufilou is a MF playing for Al-Minaa. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Pierre-Emerick Aubameyang is a FW playing for Marseille. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Shavy Babicka is a FW playing for Red Star Belgrade. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Jim Allevinah is a FW playing for Angers. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Guélor Kanga is a MF playing for Esenler Erokspor. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Mick Omfia is a DF playing for Hafia. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Urie-Michel Mboula is a DF playing for Metz. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Samaké Nzé Bagnama is a MF playing for Stade d'Abidjan. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: François Bekale is a GK playing for Hafia. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: André Biyogo Poko is a MF playing for Amed. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Mario Lemina is a MF playing for Galatasaray. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Jacques Ekomié is a DF playing for Angers. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Denis Bouanga is a FW playing for Los Angeles FC. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Jérémy Oyono is a DF playing for Frosinone. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Didier Ndong is a MF playing for Esteghlal. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Loyce Mbaba is a GK playing for Stella Club. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Edlin Randy Essang-Matouti is a FW playing for USM Khenchela. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Eric Bocoum is a MF playing for Gol Gohar Sirjan. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Jonathan Do Marcolino is a DF playing for Bourg-Péronnas. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Teddy Averlant is a FW playing for Amiens. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Gabon Player: Malick Evouna is a FW playing for Mangasport. Head coach: Thierry Mouyouma.",
  "[Full Squads and Players] Ivory Coast Manager: Emerse Faé",
  "[Full Squads and Players] Ivory Coast Player: Yahia Fofana is a GK playing for Çaykur Rizespor. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Ousmane Diomande is a DF playing for Sporting CP. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Ghislain Konan is a DF playing for Gil Vicente. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Jean Michaël Seri is a MF playing for Maribor. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Armel Zohouri is a DF playing for Iberia 1999. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Seko Fofana is a MF playing for Rennes. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Odilon Kossounou is a DF playing for Atalanta. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Franck Kessié is a MF playing for Al-Ahli. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Vakoun Issouf Bayo is a FW playing for Udinese. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Wilfried Zaha is a FW playing for Charlotte FC. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Jean-Philippe Krasso is a FW playing for Paris FC. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Willy Boly is a DF playing for Nottingham Forest. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Christopher Opéri is a DF playing for İstanbul Başakşehir. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Oumar Diakité is a FW playing for Cercle Brugge. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Amad Diallo is a FW playing for Manchester United. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Mohamed Koné is a GK playing for Charleroi. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Guéla Doué is a DF playing for Strasbourg. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Ibrahim Sangaré is a MF playing for Nottingham Forest. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Christ Inao Oulaï is a MF playing for Trabzonspor. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Emmanuel Agbadou is a DF playing for Wolverhampton Wanderers. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Evan Ndicka is a DF playing for Roma. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Evann Guessand is a FW playing for Aston Villa. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Alban Lafont is a GK playing for Panathinaikos. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Bazoumana Touré is a FW playing for TSG Hoffenheim. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Jean-Philippe Gbamin is a MF playing for Metz. Head coach: Emerse Faé.",
  "[Full Squads and Players] Ivory Coast Player: Yan Diomande is a FW playing for RB Leipzig. Head coach: Emerse Faé.",
  "[Full Squads and Players] Mozambique Manager: Chiquinho Conde",
  "[Full Squads and Players] Mozambique Player: Ernan Siluane is a GK playing for Black Bulls. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Nanani is a DF playing for Songo. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Nené is a DF playing for Black Bulls. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Fernando Chamboco is a DF playing for Black Bulls. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Bruno Langa is a DF playing for Pafos. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Manuel Kambala is a MF playing for Polokwane City. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Domingues is a MF playing for Songo. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Edmilson Dove is a DF playing for Al-Quwa Al-Jawiya. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Faisal Bangal is a FW playing for Mestre. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Geny Catamo is a FW playing for Sporting CP. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: João Bonde is a MF playing for Ferroviário Beira. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Kimiss Zavala is a GK playing for Marítimo. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Stanley Ratifo is a FW playing for Chemie Leipzig. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Oscar Cherene is a DF playing for Textáfrica. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Reinildo Mandava is a DF playing for Sunderland. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Alfons Amade is a MF playing for Dunfermline Athletic. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Mexer is a DF playing for Ankara Keçiörengücü. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Gildo Vilanculos is a FW playing for Tadamon Sour. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Witi is a FW playing for Nacional. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Keyns Abdala is a MF playing for Chaves. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Guima is a MF playing for Zira. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Ivane Urrubal is a GK playing for Songo. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Diogo Calila is a DF playing for Santa Clara. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Melque Alexandre is a FW playing for Songo. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Chamito is a FW playing for Académico Viseu. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Ângelo Cantolo* is a FW playing for Chingale. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Clésio* is a FW playing for Black Bulls. Head coach: Chiquinho Conde.",
  "[Full Squads and Players] Mozambique Player: Shaquille* is a MF playing for Sagrada Esperança. Head coach: Chiquinho Conde.",
  "[Qualification Journey] 2025_Africa_Cup_of_Nations_qualification Summary: The 2025 Africa Cup of Nations qualification matches were organised by the Confederation of African Football (CAF) to decide the participating teams of the 2025 Africa Cup of Nations in Morocco, the 35th edition of the international men's football championship of Africa. The qualification began with the preliminary round, which ran from 20 to 26 March 2024, and concluded with the group stage, which was played in September, October and November, all in 2024. A total of 24 teams qualified to play in the final tournament, including automatically-qualified hosts Morocco.",
  "[Qualification Journey] 2025_Africa_Cup_of_Nations_qualification - Entrants: All CAF member associations entered the competition, except Eritrea and Seychelles, who were excluded from the qualifiers. The seeding was based on the FIFA World Ranking from 15 February 2024, with teams ranked 1st to 44th received a bye to the qualifying group stage, while the teams ranked 45th to 52nd had to participate in the preliminary round.\nThe preliminary round draw was held on 20 February 2024, 14:00 CAT (UTC+2) at the CAF headquarters in Cairo, Egypt.\nFor the first time since their suspensions, Kenya and Zimbabwe made their phased returns to the qualifying stage.",
  "[Qualification Journey] 2025_Africa_Cup_of_Nations_qualification - Schedule: The schedule of the qualifying tournament was as follows.",
  "[Qualification Journey] 2025_Africa_Cup_of_Nations_qualification - Preliminary round: The eight teams were split into four ties which were played in home-and-away two-legged format.",
  "[Qualification Journey] 2025_Africa_Cup_of_Nations_qualification - Draw: The group stage draw took place on 4 July 2024 at 2:30 pm (UTC+2) in Johannesburg, South Africa. The 48 national teams involved were divided into twelve groups of four each, which consisted of the 44 teams that entered directly, in addition to the four winners of the preliminary round, and were seeded into four pots of twelve each based on the June 2024 FIFA World Rankings (shown in parentheses).\nTeams in bold qualified for the final tournament.",
  "[Qualification Journey] 2025_Africa_Cup_of_Nations_qualification - Tiebreakers: The teams were ranked according to points (3 points for a win, 1 point for a draw, 0 points for a loss). If tied on points, tiebreakers were applied in the following order (Regulations Article 14):\n\nPoints in head-to-head matches among tied teams;\nGoal difference in head-to-head matches among tied teams;\nGoals scored in head-to-head matches among tied teams;\nAway goals scored in head-to-head matches among tied teams;\nIf more than two teams were tied, and after applying all head-to-head criteria above, a subset of teams were still tied, all head-to-head criteria above were reapplied exclusively to this subset of teams;\nGoal difference in all group matches;\nGoals scored in all group matches;\nAway goals scored in all group matches;\nDrawing of lots",
  "[Qualification Journey] 2025_Africa_Cup_of_Nations_qualification - Goalscorers: There were 331 goals scored in 151 matches, for an average of 2.19 goals per match.\n7 goals\n\n6 goals\n\n4 goals\n\n3 goals\n\n2 goals\n\n1 goal\n\n1 own goal",
  "[Qualification Journey] 2025_Africa_Cup_of_Nations_qualification - Qualified teams: The following teams qualified for the final tournament.\n\n\n== References ==",
  "[Qualification Journey] 2025_Africa_Cup_of_Nations_qualification - Entrants: All CAF member associations entered the competition, except Eritrea and Seychelles, who were excluded from the qualifiers. The seeding was based on the FIFA World Ranking from 15 February 2024, with teams ranked 1st to 44th received a bye to the qualifying group stage, while the teams ranked 45th to 52nd had to participate in the preliminary round.\nThe preliminary round draw was held on 20 February 2024, 14:00 CAT  at the CAF headquarters in Cairo, Egypt.\nFor the first time since their suspensions, Kenya and Zimbabwe made their phased returns to the qualifying stage.",
  "[Qualification Journey] 2025_Africa_Cup_of_Nations_qualification - Preliminary round: The eight teams were split into four ties which were played in home-and-away two-legged format.",
  "[Qualification Journey] 2025_Africa_Cup_of_Nations_qualification - Goalscorers: There were 331 goals scored in 151 matches, for an average of 2.19 goals per match.\n7 goals\n\n6 goals\n\n4 goals\n\n3 goals\n\n2 goals\n\n1 goal\n\n1 own goal",
  "[Qualification Journey] 2025_Africa_Cup_of_Nations_qualification - Qualified teams: The following teams qualified for the final tournament.\n\n\n== References ==",
  "[Tournament History] African_Cup_of_Nations Summary: The Africa Cup of Nations, commonly abbreviated as AFCON and officially known as the TotalEnergies Africa Cup of Nations for sponsorship reasons, is the main biennial international men's association football competition in Africa. It is sanctioned by the Confederation of African Football (CAF) and was first held in 1957. Since 1968, it has been held every two years, switching to odd-numbered years in 2013. The competition is expected to revert to even-numbered years and become a quadrennial event, taking place in leap years from 2028.\nIn the first tournament in 1957, there were only three participating nations: Sudan, Egypt and Ethiopia. South Africa was originally scheduled to join, but was disqualified due to the apartheid policies of the government then in power. Since then, the tournament has expanded greatly, making it necessary to hold a qualifying tournament. The number of participants in the final tournament reached 16 in 1998 (16 teams were to compete in 1996, but Nigeria with",
  "[Tournament History] African_Cup_of_Nations - 1950s–60s: Origin and early years: The origin of the African Nations Cup dates from June 1956, when the creation of the Confederation of African Football was proposed during the third FIFA congress in Lisbon. There were immediate plans for a continental tournament to be held and, in February 1957, the first Africa Cup of Nations was held in Khartoum, Sudan. There was no qualification for this tournament, the field being made up of the four founding nations of CAF (Egypt, Sudan, Ethiopia, and South Africa). South Africa's insistence on selecting only white players for its squad due to its apartheid policy led to its disqualification, and as a consequence Ethiopia were handed a bye straight to the final. Hence only two matches were played, with Egypt being crowned as the first continental champion after defeating hosts Sudan in the semi-final by 2–1 and Ethiopia in the final by a score of 4–0.\nTwo years later in 1959, Egypt hosted the second ANC in Cairo with the participation of the same three teams. Host and defending champions Egypt again won, after defeating Sudan in the final by a score of 2–1 . The field grew to include nine teams for the third ANC in 1962 in Addis Ababa, and for the first time there was a qualification round to determine which four teams would play for the title. Host Ethiopia and reigning champion Egypt received automatic berths and were joined in the final four by Nigeria and Tunisia. Egypt made its third consecutive final appearance, but the Ethiopia team emerged as victors, first beating Tunisia and then downing Egypt in extra time.",
  "[Tournament History] African_Cup_of_Nations - 1960s: Ghanaian domination: In 1963, Ghana made its first appearance as it hosted the event and won the title after beating Sudan in the final. They repeated that as they became champions two years later in Tunisia—equalling Egypt as two-time winners—with a squad that included only two returning members from the 1963 team. In 1965, the CAF introduced a rule that limited the number of overseas players in each team to two. The rule persisted until 1982.\nThe 1968  competition's final tournament format expanded to include eight of the 22 teams entered in the preliminary rounds. The qualifying teams were distributed in two groups of four to play single round-robin tournaments, with the top two teams of each group advancing to semi-finals, a system that remained in use for the finals until 1992. The Democratic Republic of Congo won its first title, beating Ghana in the final. Starting with the 1968 tournament, the competition was regularly held every two years in even-numbered years; this ended with the 2012 tournament, which was followed by a tournament in 2013, and successor editions in each odd-numbered year. Ivory Coast forward Laurent Pokou led the 1968 and 1970 tournaments in scoring, with six and eight goals respectively, and his total of 14 goals remained the all-time record until 2008. Play was covered for television for the first time during the 1970 tournament in Sudan, as the hosts lifted the trophy after defeating Ghana – who were playing their fourth consecutive final.",
  "[Tournament History] African_Cup_of_Nations - 1970s: A decade of champions: Six nations won titles from 1970 to 1980: Sudan, Congo-Brazzaville, Zaire, Morocco, Ghana, and Nigeria. Zaire's second title in the 1974 edition (it won its first as the Democratic Republic of Congo) came after facing Zambia in the final.\nFor the only time to date in the history of the competition, the match had to be replayed as the first contest between the two sides ended in a 2–2 draw after extra time. The final was re-staged two days later with Zaire winning 2–0. Forward Mulamba Ndaye scored all four of Zaire's goals in these two matches: he was also the top scorer of the tournament with nine goals, setting a single-tournament record that remains unmatched. Three months earlier, Zaire had become the first Sub-Saharan African nation to qualify to the FIFA World Cup. Morocco won their first title in the 1976 ANC held in Ethiopia and Ghana took its third championship in 1978, becoming the first nation to win three titles.",
  "[Tournament History] African_Cup_of_Nations - 1980s: Cameroonian domination: Between 1980 and 1990, Cameroon managed to reach the final of the Africa Cup three times in a row, winning the competition twice in 1984 and 1988 and losing once on penalties against Egypt in the 1986 edition, the other dominant team during this period was Algeria, along with their solid 1982 and decent 1986 World Cup appearances, the North African nation lost in the final against hosts Nigeria in the 1980 tournament allowing the Super Eagles to capture their first championship. After the 1980 edition, Algeria reached the semi-finals of every edition except the 1986 cup until they eventually won the competition in 1990. Ghana's fourth continental title came in the 1982 cup tournament, where they beat host Libya in the final. The match ended in a 1–1 draw after 120 minutes and Ghana national football team won the penalty shootout to become champions.",
  "[Tournament History] African_Cup_of_Nations - 1990s: The return of South Africa: In 1990, the 1990 African Cup of Nations was the 17th edition of the Africa Cup of Nations, the football championship of Africa (CAF). It was hosted by Algeria. Just like in 1988, the field of eight teams was split into two groups of four. Algeria won its first championship, beating Nigeria in the final 1–0. Nigeria lost once again as they made their third final appearance in four tournaments, this time falling to host Algeria.\nThe 1992 Cup of Nations expanded the number of final tournament participants to 12; the teams were divided into four groups of three, with the top two teams of each group advancing to quarter-finals. Ghanaian midfielder Abedi \"Pele\" Ayew, who scored three goals, was named the best player of the tournament after his contributions helped Ghana reach the final; he was, however, suspended for that match and Ghana lost to Ivory Coast in a penalty shootout that saw each side make 11 attempts to determine the winner. Ivory Coast set a record for the competition by holding each of their opponents scoreless in the six matches of the final tournament.\nThe 12-team, three-group format was used again two years later, where hosts Tunisia were humiliated by their first-round elimination. Nigeria, who had just qualified to the World Cup for the first time in their history, won the tournament, beating Zambia, who a year before had been struck by disaster when most of their national squad died in a plane crash while traveling to play a 1994 World Cup qualification match. Nigerian forward Rashidi Yekini, who had led the 1992 tournament with four goals, repeated as the top scorer with five goals.\nSouth Africa hosted the 20th ACN competition in 1996, marking its first ever appearance after a decades-long ban was lifted with the end of apartheid in the country, which had been followed by a failed attempt to qualify in 1994. The number of final-round participants in 1996 was expanded to 16, split into four groups. However, the actual number of teams playing in the ",
  "[Tournament History] African_Cup_of_Nations - 2000s: Egypt's unprecedented treble: The 2000 edition was hosted jointly by Ghana and Nigeria, who replaced the originally designated host Zimbabwe. Following a 2–2 draw after extra time in the final, Cameroon defeated Nigeria on penalty kicks. In 2002, Cameroon's Indomitable Lions won their second consecutive title. This was the first repeat since Ghana had done it in the 1960s and after Egypt had done it before in 1957 and 1959. The Cameroonians beat first-time finalists Senegal, who also debuted in the World Cup later that year, via penalty kicks. Both finalists were eliminated in the quarter-finals two years later in Tunisia, where the hosts won their first title, beating Morocco 2–1 in the final.\nThe 2006 tournament was also won by the hosts, Egypt, who reached a continental-record fifth title. Ahead of the 2008 Africa Cup of Nations several European clubs called for a rethink of the tournament's schedule. Given that it takes place during the European season, players who are involved miss several matches for their clubs. In January 2008, FIFA president Sepp Blatter announced that he wanted the tournament to be held in either June or July by 2016, to fit in the international calendar, although this would preclude many countries in central and west Africa from hosting the competition (for these months occur during their wet season). The 2008 tournament was hosted by Ghana, and saw Egypt retain the trophy, winning its record-extending sixth tournament by defeating Cameroon 1–0 in the final.",
  "[Tournament History] African_Cup_of_Nations - 2010s: Switch to odd years: Egypt set a new record in the 2010 tournament (hosted by Angola) by winning its third consecutive title in an unprecedented achievement on the African level after defeating Ghana 1–0 in the final, retaining the gold-plated cup indefinitely and extending its record to seven continental titles (including when Egypt was known as UAR between 1958 and 1961). Egypt became the first African nation to win three consecutive cups and joined Mexico, Argentina, and Iran who also won their continent cup three times in a row. On 31 January 2010, Egypt set a new African record, not being defeated for 19 consecutive Cup of Nations matches, since a 2–1 loss against Algeria in Tunisia in 2004, and a record 9 consecutive win streak. In May 2010, it was announced that the tournament would be moved to odd-numbered years from 2013 in order to prevent the tournament from taking place in the same year as the World Cup. It also meant there were two tournaments within twelve months in January 2012 (co-hosted by Gabon and Equatorial Guinea) and January 2013 (hosted by South Africa). The change of FIFA Confederations Cup from a biennial to a quadrennial tournament, and the switching of the Africa Cup of Nations from even to odd-number years, meant that some previous Africa Cup of Nations champions such as Egypt, Zambia, and Ivory Coast (winners of the 2010, 2012, and 2015 tournaments respectively) were deprived from participating in the Confederations Cup tournament.In 2011, Morocco won the bid to host the 2015 edition, and Libya won the right to host the 2013 tournament, but the 2011 Libyan civil war prompted Libya and South Africa to trade years, with South Africa hosting in 2013 and Libya hosting in 2017. Ongoing fighting in Libya ultimately prompted CAF to move the 2017 tournament to Gabon). In 2012, Zambia won the final after a penalty shootout against Ivory Coast. This drew increased media attention since the match took place in Gabon, only a few hundred meters from the crash site of the",
  "[Tournament History] African_Cup_of_Nations - Since 2019: Tournament expansion and date change: In July 2017, under Ahmad Ahmad's presidency, two changes were approved: switching the timing of the competition from January to the Northern Hemisphere summer and expanding from 16 to 24 teams (effective from the 2019 Africa Cup of Nations).\nAlgeria won the African Cup of Nations 2019, defeating Senegal 1–0 in the final. The title was Algeria's second, and first since 1990. Nigeria came third after beating Tunisia 1–0 in their third-place decider match. The prize money awarded to the 2019 Africa Cup of Nations winner amounted to $4.5 million while runners-up Senegal got $2.5 million.\nMatch days 3 and 4 of the 2021 Africa Cup of Nations qualifiers, which was slated from 25 to 30 March 2020, were postponed due to the COVID-19 pandemic. The 2021 Africa Cup of Nations tournament, hosted by Cameroon, was postponed to 2022 due to the COVID-19 pandemic. The Confederation of African Football increased the cash prize for the winner from $4.5 million to $5 million for the 2021 Africa Cup of Nations while the second-best team would get $2.75 million. Senegal won the tournament for the first time after defeating Egypt on penalties in the final. In that tournament, Salima Mukansanga became the first woman to referee at the Africa Cup of Nations, leading an all-woman officiating team of Fatiha Jermoumi (Morocco), Carine Atemzabong (Cameroon), and Bouchra Karboubi (Morocco) as the VAR.\nThe 2023 edition of the Cup was held from January 2024, mainly due to the heat in host Ivory Coast.\nThe 2025 event is being held in December 2025 and January 2026, with the timing due to the new quadrennial FIFA Club World Cup tournament. Prize money has been increased from US$7 million in 2023 to US$10 million in 2025. Morocco are set to host AFCON in 2025 and will kick start the competition with a clash against Comoros.",
  "[Tournament History] African_Cup_of_Nations - 2028-: Return to even-numbered years and change in frequency: On 20 December 2025, CAF announced that the tournament would return to even-numbered years and would become a quadrennial event starting with the 2028 edition. In addition, it was announced that an annual African Nations League would commence in 2029.  The 2027 Africa Cup of Nations, scheduled to be jointly hosted by Kenya, Tanzania, and Uganda, will take place as planned, followed by another edition in 2028 before the new four-year cycle begins.",
  "[Tournament History] African_Cup_of_Nations - Format: The number of teams and the format of each final tournament have varied over the years. In most tournaments, the tournament consists of a round-robin group stage followed by a single-elimination knockout stage.\n\nSince the 1962 edition, this competition has been held in two phases: a qualification phase (or called the elimination phase) and a final tournament. The host country of the final tournament is automatically qualified, and in the first editions the defending champion was also qualified for the following tournament.",
  "[Tournament History] African_Cup_of_Nations - Qualifying: The qualification phase has evolved over time according to the increasing number of nations affiliated to the Confederation of African Football (CAF). It was set up from 1962, during the first two editions of the Africa Cup of Nations, the founding nations of the CAF participated in the final tournament, namely Egypt, Ethiopia and Sudan (South Africa was excluded just after its foundation due to Apartheid).\nIn 1962, new nations were affiliated and forced CAF to set up a qualifying phase for the final tournament in the form of knockout matches. This system was used until the 1992 edition, when the organization of the qualifying phase became closer to that of the UEFA European Championship, with qualifying groups of four to seven teams depending on the editions where each selection plays a round-trip opposition against each of its opponents, the qualified country being decided according to its classification within its group.",
  "[Tournament History] African_Cup_of_Nations - Final phase: Only the hosts received an automatic qualification spot, with the other 23 teams qualifying through a qualification tournament. At the finals, the 24 teams were drawn into six groups of four teams each. The teams in each group played a single round robin.\nAfter the group stage, the top two teams and the four best third-placed teams advanced to the round of 16. The winners advanced to the quarter-finals. The winners of the quarter-finals advanced to the semi-finals. The losers of the semi-finals played in a third-place play-off, while winners of the semi-finals played in the final.",
  "[Tournament History] African_Cup_of_Nations - Trophy and medals: Throughout the history of the Africa Cup of Nations, three trophies have been awarded to the winners of the competition. The original trophy, made of silver, was the Abdelaziz Abdallah Salem Trophy, named after the first CAF president, Egyptian Abdelaziz Abdallah Salem. As the first winner of three Africa Cup of Nations tournaments, Ghana obtained the right to permanently hold the trophy in 1978.\nThe second trophy was awarded from 1980 to 2000 and was named \"Trophy of African Unity\" or \"African Unity Cup\". It was given to CAF by the Supreme Council for Sports in Africa prior to the 1980 tournament and it was a cylindrical piece with the Olympic rings over a map of the continent engraved on it. It sat on a squared base and had stylized triangular handles. Cameroon won the Unity Cup indefinitely after they became three-time champions in 2000.\nIn 2001, the third trophy was revealed, a gold-plated cup designed and made in Italy. Cameroon, permanent holders of the previous trophy, were the first nation to be awarded the new trophy after they won the 2002 edition. Egypt won the gold-plated cup indefinitely after they became three-time champions in 2010. Unlike previous winners who would have then taken the trophy home, Egypt was presented with a special full-size replica that they were allowed to keep. The winner of each edition receives a replica whose dimensions are equal to that of the original trophy.\nCAF give 30 gold medals to the winning team, 30 silver medals to the runners-up, 30 bronze medals to the team ranked third and 30 diplomas to the team ranked fourth in the final tournament.",
  "[Tournament History] African_Cup_of_Nations - Results: Keys\na.e.t.: after extra time\np: penalty shoot-out\nawd: awarded result.\nTBD: to be determined.",
  "[Tournament History] African_Cup_of_Nations - Summary: 1 as United Arab Republic\n2 as Congo-Kinshasa\n3 as Zaire",
  "[Tournament History] African_Cup_of_Nations - Awards: There are currently six post-tournament awards\n\nthe Best Player for most valuable player;\nthe Top Goal-scorer for most prolific goal scorer;\nthe Best Goalkeeper for most outstanding goalkeeper;\nthe Best Young Player for most outstanding young player;\nthe Team of the Tournament for best combined team of players at the tournament;\nthe Fair Play Award for the team with the best record of fair play.",
  "[Tournament History] African_Cup_of_Nations - Further reading: The Great Adventure of African Football (FIFA)\nHistory of African Nations cup since 1957 (Egypt State Information Service)",
  "[Tournament History] African_Cup_of_Nations - Format: The number of teams and the format of each final tournament have varied over the years. In most tournaments, the tournament consists of a round-robin group stage followed by a single-elimination knockout stage.\n\nSince the 1962 edition, this competition has been held in two phases: a qualification phase  and a final tournament. The host country of the final tournament is automatically qualified, and in the first editions the defending champion was also qualified for the following tournament.",
  "[Tournament History] African_Cup_of_Nations - Qualifying: The qualification phase has evolved over time according to the increasing number of nations affiliated to the Confederation of African Football . It was set up from 1962, during the first two editions of the Africa Cup of Nations, the founding nations of the CAF participated in the final tournament, namely Egypt, Ethiopia and Sudan .\nIn 1962, new nations were affiliated and forced CAF to set up a qualifying phase for the final tournament in the form of knockout matches. This system was used until the 1992 edition, when the organization of the qualifying phase became closer to that of the UEFA European Championship, with qualifying groups of four to seven teams depending on the editions where each selection plays a round-trip opposition against each of its opponents, the qualified country being decided according to its classification within its group.",
  "[Tournament History] African_Cup_of_Nations - Final phase: Only the hosts received an automatic qualification spot, with the other 23 teams qualifying through a qualification tournament. At the finals, the 24 teams were drawn into six groups of four teams each. The teams in each group played a single round robin.\nAfter the group stage, the top two teams and the four best third-placed teams advanced to the round of 16. The winners advanced to the quarter-finals. The winners of the quarter-finals advanced to the semi-finals. The losers of the semi-finals played in a third-place play-off, while winners of the semi-finals played in the final.",
  "[Tournament History] African_Cup_of_Nations - Awards: There are currently six post-tournament awards\n\nthe Best Player for most valuable player;\nthe Top Goal-scorer for most prolific goal scorer;\nthe Best Goalkeeper for most outstanding goalkeeper;\nthe Best Young Player for most outstanding young player;\nthe Team of the Tournament for best combined team of players at the tournament;\nthe Fair Play Award for the team with the best record of fair play.",
  "[Host Team Info] Morocco_national_football_team Summary: The Morocco national football team (Arabic: المنتخب المغربي لكرة القدم) represents Morocco in men's international football. It is controlled by the Royal Moroccan Football Federation (FRMF), the governing body for football in Morocco. It has been affiliated with FIFA since 1960, with CAF since 1959, and with UNAF since 2005. The team is known as the Atlas Lions. They play home matches at the Prince Moulay Abdellah Stadium in Rabat and train at the Mohammed VI Football Complex in Salé.\nMorocco is regarded as one of Africa’s most successful national football teams. They have won four continental titles, including the 1976 African Cup of Nations and the African Nations Championship in 2018, 2020 and 2024. Morocco has also qualified for the FIFA World Cup on seven occasions. In 1986, they made history as the first African team to top a World Cup group and advance to the knockout stage, where they were eliminated 1–0 by eventual runner-up West Germany. Thirty-six years later, at the 2022 FI",
  "[Host Team Info] Morocco_national_football_team - Formation and early years: The Moroccan national team was founded in 1928 and played its first game on 22 December of that year against France's B team, losing 2–1. This team, formed by the best footballers of the LMFA, or the Moroccan Football League (settlers or natives), was active in friendly matches against other North African teams such as Algeria and Tunisia. These associations of settler clubs and local footballers, in addition to having their own championship, clashed with each other in a tournament that Morocco won several times, such as in 1948–1949. The LMFA also faced other club teams such as NK Lokomotiva Zagreb in January 1950, as well as France A and France B.\n\nOn 9 September 1954, an earthquake struck the Algerian region of Orléansville (now Chlef), destroying the city and killing 1,400 people. On 7 October 1954, the French Football Association and the Maghreb inhabitants organized a charity match to raise funds for the families of the victims of the earthquake. In the match, held at the Parc de Princes in Paris, a team made up of Moroccans, Algerians and Tunisians played against France. Led by star Larbi Benbarek, the Maghreb selection managed to win 3–2, a month before the Toussaint Rouge attacks by the Algerian National Liberation Front which marked the beginning of the Algerian War.\nIn 1955, the Royal Moroccan Football Federation was established, at the end of the French protectorate of Morocco, which had lasted since 1912.\nOn 19 October 1957, at the second edition of the Arab Games in Lebanon, Morocco made its debut as an independent country against Iraq, at the Camille Chamoun Sports City Stadium, and drew 3–3. At the tournament, Morocco recorded their first-ever win, defeating Libya 5–1, then beat Tunisia 3–1 to reach the semi-finals. After a 1–1 draw with Syria, lots were drawn to decide who would progress to the final, and Syria were selected at Morocco's expense. Morocco withdrew from the third-place play-off against Lebanon and finished fourth overall.\nBetween 1957",
  "[Host Team Info] Morocco_national_football_team - First appearances in international competitions (1963–1976): Morocco participated in the final phase of an international competition for the first time at the 1964 Tokyo Olympics. Having qualified under the leadership of manager Mohamed Massoun, the Moroccans were included in a group of three teams due to the withdrawal of North Korea. Morocco lost both their matches, against Hungary (6–0, the team's worst-ever defeat) and Yugoslavia (3–1, despite taking the lead in the second minute via Ali Bouachra).\nIn 1966, the Moroccan Football Association joined the Confederation of African Football, and the team participated in qualifying for the 1970 World Cup in Mexico. Their debut eliminated Senegal (1–0) and Tunisia after a draw. In the final round of the preliminaries, against Sudan and Nigeria, Morocco obtained five points, finishing ahead of Nigeria. Shortly after, Morocco lost the decisive play-off against Algeria to enter the final stage of the 1970 Africa Cup of Nations.\nMorocco thus became the first African national team to qualify for the World Cup after having played in an elimination tournament. The Moroccan team, coached by the Yugoslav Blagoje Vidinić, consisted entirely of players in the Moroccan league, including Driss Bamous and Ahmed Faras.\nOn 3 June 1970, against West Germany, Morocco opened the scoring with a goal in the 21st minute of the game scored by Houmane Jarir. In the second half, however, the Germans scored twice and won 2–1. The Atlas Lions then played against Peru, conceding three goals in ten minutes to lose 3–0. On 11 June 1970, the eliminated Moroccans drew with Bulgaria 1–1. It was the first point obtained by an African national team at the World Cup.\nIn 1972 Africa Cup of Nations qualification, the Atlas Lions ousted Algeria, then faced Egypt, defeating them 3–0 in the first leg and suffering a 3–2 defeat on the way back. However, the aggregate win meant they qualified for the final phase of the continental tournament for the first time. In the group stage, they accumulated three 1–1 draws against ",
  "[Host Team Info] Morocco_national_football_team - Between successes and defeats (1976–1986): Morocco, coached by the Romanian Virgil Mărdărescu and captained by Faras, took the continental throne at 1976 African Cup of Nations, in only the country's second participation in the competition. Ahmed Makrouh scored in the final to equalize at 1–1, which gave Morocco the first, and to date, only cup in its history.\nAfter failing to qualify for the 1974 FIFA World Cup, they also missed the 1978 and 1982 tournaments. At the 1978 Africa Cup of Nations, they were eliminated in the first round, while in 1980 they finished in third place, beating Egypt 2–0. They then won the 1983 Mediterranean Games, played at home, after a 3–0 win in the final against Turkey B.\nMorocco did not qualify for either the 1982 or 1984 Africa Cup of Nations. Two years later, they finished fourth, losing 3–2 in the third-place play-off to Ivory Coast.",
  "[Host Team Info] Morocco_national_football_team - Difficult Years (1986–2000): Morocco qualified for the 1986 FIFA World Cup in Mexico, and topped a group consisting Portugal, England and Poland, thanks to two draws against the English and Polish and a 3–1 win against the Portuguese. However, they were narrowly eliminated by West Germany in the first knockout round, thanks to a goal from Lothar Matthäus one minute from the end of regulation time. Morocco became the first African and Arab national team to advance from the first round of the World Cup.\nTwo years later, the Moroccan team presented itself at the 1988 African Cup of Nations as a host country with high expectations. After winning in the first round, they were eliminated in the semi-finals by Cameroon and finished in fourth place after losing the third-place play-off against Algeria 1–1 after extra time, 4–3 after penalties.\nFailure to qualify for the 1990 FIFA World Cup opened a period of crisis. In the 1992 African Cup of Nations, the team was eliminated in the first round. They then did not participate in the 1994 or 1996 African Cup tournaments. They, however, did qualify for the 1994 World Cup in the United States and the 1998 tournament in France.\nAt the 1998 Africa Cup of Nations, after winning their group, Morocco were defeated by South Africa 2–1.",
  "[Host Team Info] Morocco_national_football_team - Golden Generation (2004–present): Morocco took part in the 2004 African Cup of Nations, drawn into Group D defeating Nigeria 1–0, defeating Benin 4–0 and drawing 1–1 with South Africa. Morocco qualified to the knockout stages, facing Algeria; they eventually won 3–1 in extra time, and 4–0 against Mali in the semi-final. They lost the 2004 African Cup of Nations Final against Tunisia 2–1.\nIn 2012, the national team won the Arab Cup, topping their group, defeating Iraq in the semi-final and Libya in the final.\nIn 2014, Morocco debuted in the African Nations Championship after failing to qualify in the 2009 and 2011 editions. Led by coach Hassan Benabicha, Morocco were eliminated in the second round after losing 4–3 to Nigeria in the quarter-finals. They managed to qualify for the 2016 African Nations Championship, but were eliminated in the group stages. Morocco hosted the 2018 African Nations Championship, which included a victory for the home nation, the third North African country to win the competition's title.\n\nMorocco returned to the World Cup after a 20-year absence in 2018. The North Africans were drawn in Group B with World Cup favourites Spain, Portugal, and Iran. In their opening game against Iran, Morocco showed full dedication but lost 1–0 in the final minutes of the match, scored by an own goal. In their second game, Morocco faced Portugal but ended losing 1–0 by a goal scored by Cristiano Ronaldo and also got eliminated from the tournament. In the last match against Spain they took a 2–1 lead, with goals scored by Khalid Boutaïb and Youssef En-Nesyri, but the match eventually ended 2–2.\n\nMorocco entered the 2019 AFCON with high confidence and players claiming them to be the favourite to win. However, in spite of three straight group stage wins, Morocco were shockingly knocked out by Benin in the round of sixteen.\nAt the 2020 African Nations Championship in Cameroon, Morocco won their second CHAN title, in its second consecutive final appearance. Captained by Ayoub El Kaabi, they defeate",
  "[Host Team Info] Morocco_national_football_team - Home stadiums: Morocco’s primary home stadium is Prince Moulay Abdellah Stadium in Rabat, where the national team plays most of its home matches.\nDuring Ezzaki Badou's tenure as coach from 2014 to 2016, Morocco played most of its matches at the Adrar Stadium in Agadir, which has a capacity of 45,480. A friendly was played there during Hervé Renard's tenure between Morocco and the Netherlands in 2017.\n\nMorocco also has several other large stadiums, including Fez Stadium, Marrakesh Stadium, and Ibn Battouta Stadium in Tangier.",
  "[Host Team Info] Morocco_national_football_team - Kit suppliers: Morocco's home colours are most red shirts and green shorts and socks. Away colours are usually all white or all green.",
  "[Host Team Info] Morocco_national_football_team - Results and fixtures: The following is a list of match results in the last 12 months, as well as any future matches that have been scheduled.\n  Win\n  Draw\n  Loss\n  Fixture",
  "[Host Team Info] Morocco_national_football_team - Current squad: The following players were called up for the 2025 Africa Cup of Nations.\nCaps and goals are correct as of 26 December 2025, after the match against Mali.",
  "[Host Team Info] Morocco_national_football_team - Recent call-ups: The following players have also been called up for the team in the last twelve months.",
  "[Host Team Info] Morocco_national_football_team - Player records: As of 29 December 2025\nStatistics include official FIFA-recognised matches only.\nPlayers in bold are still active with Morocco.",
  "[Host Team Info] Morocco_national_football_team - FIFA World Cup: Morocco's national football team has participated in the World Cup six times. Their best performance was in the 2022 tournament where they finished in fourth place, becoming the first African and Arab nation to reach the semi-finals of the tournament.",
  "[Host Team Info] Morocco_national_football_team - Olympic Games: Football at the Summer Olympics has been an under-23 tournament since the 1992 edition.",
  "[Host Team Info] Morocco_national_football_team - African Games: Prior to the Cairo 1991 campaign, the Football at the All-Africa Games was open to full senior national teams.",
  "[Host Team Info] Morocco_national_football_team - Mediterranean Games: 1951 to 1987 senior teams, from 1991 youth teams.",
  "[Host Team Info] Morocco_national_football_team - Head-to-head performance: Correct as of 29 December 2025 after the match against Zambia.",
  "[Host Team Info] Morocco_national_football_team - Summary: Notes\nOfficial subregional competition organized and recognized by FIFA since 2021. Previous editions were organized by UAFA.",
  "[Host Team Info] Morocco_national_football_team - Results and fixtures: The following is a list of match results in the last 12 months, as well as any future matches that have been scheduled.\n  Win\n  Draw\n  Loss\n  Fixture",
  "[Host Team Info] Morocco_national_football_team - Current squad: The following players were called up for the 2025 Africa Cup of Nations.\nCaps and goals are correct as of 26 December 2025, after the match against Mali.",
  "[Host Team Info] Morocco_national_football_team - Player records: As of 29 December 2025\nStatistics include official FIFA-recognised matches only.\nPlayers in bold are still active with Morocco.",
  "[Host Team Info] Morocco_national_football_team - Summary: The Morocco national football team  represents Morocco in men's international football. It is controlled by the Royal Moroccan Football Federation , the governing body for football in Morocco. It has been affiliated with FIFA since 1960, with CAF since 1959, and with UNAF since 2005. The team is known as the Atlas Lions. They play home matches at the Prince Moulay Abdellah Stadium in Rabat and train at the Mohammed VI Football Complex in Salé.\nMorocco is regarded as one of Africa’s most successful national football teams. They have won four continental titles, including the 1976 African Cup of Nations and the African Nations Championship in 2018, 2020 and 2024. Morocco has also qualified for the FIFA World Cup on seven occasions. In 1986, they made history as the first African team to top a World Cup group and advance to the knockout stage, where they were eliminated 1–0 by eventual runner-up West Germany. Thirty-six years later, at the 2022 FIFA World Cup, Morocco topped a group that included Croatia, Canada and Belgium. They then went on to defeat Spain and Portugal, becoming the first African and first Arab team to reach a World Cup semi-final. They were also the third World Cup semi-finalist from outside Europe or South America. In 2025, Morocco set a world record for the longest winning streak in international football, achieving 19 consecutive victories across all competitions.\nThe Atlas Lions were ranked 10th in the FIFA World Rankings in April 1998. They were Africa’s highest-ranked national team for three consecutive years, from 1997 to 1999, and have again occupied that position since December 2022. As of November 2025, Morocco is ranked 11th in the world.\nMorocco is set to become the second African nation, the second MENA nation, and the first North African nation to host the FIFA World Cup, after being chosen as a co-host for the 2030 edition alongside Portugal and Spain. Morocco has also hosted the Africa Cup of Nations  on two occasions, in 1988 and 2025."
]